app/controllers/todos_controller.rb

  def create
    @todo = current_user.todos.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Learn SASS"], ["user_id", 1], ["created_at", "2015-09-25 22:08:32.491499"], ["updated_at", "2015-09-25 22:08:32.491499"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "description" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["description", "Learn Coffeescript"], ["updated_at", "2015-09-26 02:12:51.573470"], ["id", 2]]

  def destroy
    @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]

  def complete
    if @todo.completed_at?
      @todo.update(completed_at: nil)
---
UPDATE "todos" SET "completed_at" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed_at", "2015-09-24 16:31:22.190530"], ["updated_at", "2015-09-24 16:31:22.191453"], ["id", 5]]

    def set_todo
      @todo = current_user.todos.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."user_id" = $1 AND "todos"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]